HunterHykes/Senior_Design_HALO/Nick/dsPIC33EP512GM706_PIM.X/main.c
/**
  Generated main.c file from MPLAB Code Configurator

  @Company
    Microchip Technology Inc.

  @File Name
    main.c

  @Summary
    This is the generated main.c using PIC24 / dsPIC33 / PIC32MM MCUs.

  @Description
    This source file provides main entry point for system initialization and application code development.
    Generation Information :
        Product Revision  :  PIC24 / dsPIC33 / PIC32MM MCUs - 1.170.0
        Device            :  dsPIC33EP512GM706
    The generated drivers are tested against the following:
        Compiler          :  XC16 v1.61
        MPLAB 	          :  MPLAB X v5.45
*/

/*
    (c) 2020 Microchip Technology Inc. and its subsidiaries. You may use this
    software and any derivatives exclusively with Microchip products.

    THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER
    EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED
    WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A
    PARTICULAR PURPOSE, OR ITS INTERACTION WITH MICROCHIP PRODUCTS, COMBINATION
    WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION.

    IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE,
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND
    WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS
    BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE
    FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN
    ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
    THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.

    MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE
    TERMS.
*/

/**
  Section: Included Files
*/
#include <xc.h>
#include <stdbool.h>

#define FCY 4000000UL // clock frequency
#include <libpic30.h>

#include "mcc_generated_files/mcc.h"
//#include "mcc_generated_files/system.h"
#include "mcc_generated_files/fatfs/fatfs_demo.h"
#include "I2C_Handler.h"
#include "Initialize.h"
#include "stdint.h"

// Address Definitions
#define MUX_0 0x70
#define MUX_1 0x71

/* * * * * * * * * * * Accelerometer Definitions * * * * * * * * * * */
#define H3LIS200DL_I2CADDR 0x19
#define H3LIS200DL_WHO_AM_I 0x0F
#define H3LIS200DL_CTRL_REG1 0x20
#define H3LIS200DL_CTRL_REG2 0x21
#define H3LIS200DL_CTRL_REG3 0x22
#define H3LIS200DL_CTRL_REG4 0x23
#define H3LIS200DL_CTRL_REG5 0x24
#define H3LIS200DL_HP_FILTER_RESET 0x25
#define H3LIS200DL_REFERENCE 0x26
#define H3LIS200DL_STATUS_REG 0x27
#define H3LIS200DL_OUT_X_H 0x29               // X Data
#define H3LIS200DL_OUT_X_L 0x28
#define H3LIS200DL_OUT_Y_H 0x2B               // Y Data
#define H3LIS200DL_OUT_Y_L 0x2A
#define H3LIS200DL_OUT_Z_H 0x2D               // Z Data
#define H3LIS200DL_OUT_Z_L 0x2C
#define H3LIS200DL_INT1_CFG 0x30            // Interrupt 1 (Pin 11, used)
#define H3LIS200DL_INT1_SRC 0x31
#define H3LIS200DL_INT1_THS 0x32
#define H3LIS200DL_INT1_DURATION 0x33
#define H3LIS200DL_INT2_CFG 0x34            // Interrupt 2
#define H3LIS200DL_INT2_SRC 0x35
#define H3LIS200DL_INT2_THS 0x36
#define H3LIS200DL_INT2_DURATION 0x37
                                // POWER MODES
#define H3LIS200DL_PWR_DWN 0x00     // Power Down Mode
#define H3LIS200DL_NRML 0x01        // Normal Mode
#define H3LIS200DL_LP_0_5HZ 0x02    // Low Power 0.5Hz
#define H3LIS200DL_LP_1HZ 0x03      // Low Power 1.0Hz
#define H3LIS200DL_LP_2HZ 0x04      // Low Power 2.0Hz
#define H3LIS200DL_LP_5HZ 0x05      // Low Power 5.0Hz
#define H3LIS200DL_LP_10HZ 0x06     // Low Power 10.Hz
                                // OUTPUT DATA RATES
#define H3LIS200DL_DR_50HZ 0x00     // 50Hz
#define H3LIS200DL_DR_100HZ 0x01    // 100Hz
#define H3LIS200DL_DR_400HZ 0x02    // 400Hz
#define H3LIS200DL_DR_1000HZ 0x03   // 1000Hz

#define H3LIS200DL_EN_X 0x01    // Enable X Data
#define H3LIS200DL_EN_Y 0x02    // Enable Y Data
#define H3LIS200DL_EN_Z 0x04    // Enable Z Data
#define H3LIS200DL_EN_XYZ 0x07  // Enable X, Y, and Z Data

//Accelerometer Function Definitions
typedef enum {USE_I2C, USE_SPI} comm_mode;
typedef enum {POWER_DOWN, NORMAL, LOW_POWER_0_5HZ, LOW_POWER_1HZ,
                LOW_POWER_2HZ, LOW_POWER_5HZ, LOW_POWER_10HZ} power_mode;
typedef enum {DR_50HZ, DR_100HZ, DR_400HZ, DR_1000HZ} data_rate;
typedef enum {HPC_8, HPC_16, HPC_32, HPC_64} high_pass_cutoff_freq_cfg;
typedef enum {PUSH_PULL, OPEN_DRAIN} pp_od;
typedef enum {INT_SRC, INT1_2_SRC, DRDY, BOOT} int_sig_src;
typedef enum {LOW_RANGE, MED_RANGE, NO_RANGE, HIGH_RANGE} fs_range;
typedef enum {X_AXIS, Y_AXIS, Z_AXIS} int_axis;
typedef enum {TRIG_ON_HIGH, TRIG_ON_LOW} trig_on_level;
  

void H3LIS200DL_begin();
void H3LIS200DL_axesEnable(bool enable);
void H3LIS200DL_setPowerMode(power_mode pmode);
void H3LIS200DL_setODR(data_rate drate);
void H3LIS200DL_readAxes(int16_t* x, int16_t* y, int16_t* z);
uint8_t H3LIS200DL_readReg(uint8_t reg_address);
float H3LIS200DL_convertToG(int maxScale, int reading);
void H3LIS200DL_setHighPassCoeff(high_pass_cutoff_freq_cfg hpcoeff);
void H3LIS200DL_enableHPF(bool enable);
void H3LIS200DL_HPFOnIntPin(bool enable, uint8_t pin);
void H3LIS200DL_intActiveHigh(bool enable);
void H3LIS200DL_intPinMode(pp_od _pinMode);
void H3LIS200DL_latchInterrupt(bool enable, uint8_t intSource);
void H3LIS200DL_intSrcConfig(int_sig_src src, uint8_t pin);
void H3LIS200DL_setFullScale(fs_range range);
bool H3LIS200DL_newXData();
bool H3LIS200DL_newYData();
bool H3LIS200DL_newZData();
void H3LIS200DL_enableInterrupt(int_axis axis, trig_on_level trigLevel,uint8_t interrupt, bool enable);
void H3LIS200DL_setIntDuration(uint8_t duration, uint8_t intSource);
void H3LIS200DL_setIntThreshold(uint8_t threshold, uint8_t intSource);
int16_t H3LIS200DL_Read_x(int16_t x);
int16_t H3LIS200DL_Read_y(int16_t y);
int16_t H3LIS200DL_Read_z(int16_t z);

comm_mode mode;    // comms mode, I2C or SPI
uint8_t address;   // I2C address
uint8_t CSPin;

// End Function Definitions

// ADXL345 Accelerometer
#define ADXL345_I2C_ADDR 0x53 // 0x53   0xE5
#define ADXL345_OFSX 0x1E
#define ADXL345_OFSY 0x1F
#define ADXL345_OFSZ 0x20
#define ADXL345_DUR 0x21
#define ADXL345_LATENT 0x22
#define ADXL345_WINDOW 0x23
#define ADXL345_THRESH_ACT 0x24
#define ADXL345_THRESH_INACT 0x25
#define ADXL345_TIME_INACT 0x26
#define ADXL345_ACT_INACT_CTL 0x27
#define ADXL345_THRESH_FF 0x28
#define ADXL345_TIME_FF 0x29
#define ADXL345_ACT_AXES 0x2A
#define ADXL345_ACT_TAP_STATUS 0x2B
#define ADXL345_BW_RATE 0x2C
#define ADXL345_POWER_CTL 0x2D
#define ADXL345_INT_ENABLE 0x2E
#define ADXL345_INT_MAP 0x2F
#define ADXL345_INT_SOURCE 0x30
#define ADXL345_DATA_FORMAT 0x31
#define ADXL345_DATA_X0 0x32
#define ADXL345_DATA_X1 0x33
#define ADXL345_DATA_Y0 0x34
#define ADXL345_DATA_Y1 0x35
#define ADXL345_DATA_Z0 0x36
#define ADXL345_DATA_Z1 0x37
#define ADXL345_FIFO_CTL 0x38
#define ADXL345_FIFO_STATUS 0x39
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

