HunterHykes/Senior_Design_HALO/Nick/dsPIC33EP512GM706_PIM.X/main.c
/* * * * * * * * * * * LED Display Functions * * * * * * * * * * */
void showBinary(uint8_t n);
void showStartup(void);
void showCount(void);
void showError(void);
void showToF(uint16_t dist);
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/*
                         Main application
 */

int main(void) {
    // ToF Variables
    uint16_t distance; // distance from ToF sensor
    
    // Accelerometer Variables
    int16_t x = 0, y = 0, z = 0;
    uint16_t yp;
    //uint8_t accelData[6];
    //uint16_t X, Y, Z;
    
    // SD information variables
    //uint8_t SD_status;
    
    // initialize the device
    SYSTEM_Initialize();    // MCC: I2C1, TMR1, SPI1 initialization
    Start_Initialization(); // for pins/LEDs
    showStartup();          // run LED startup pattern
    
    /* * * * * * * * * * * * * * SD Task * * * * * * * * * * * * * */
    
//    FATFS drive;        // Work area (filesystem object) for logical drive
//    FIL file;           // File to write
//    UINT actualLength;  // Actual length of
//    char data[] = "Hello, World!\r\n";
//    char data2[] = "Haha filename funny.\r\n";
//    
//    if( SD_SPI_IsMediaPresent() == false)
//    {
//        return;
//    }
//    SD_status = f_mount(&drive,"0:", 1);
//    if (SD_status == FR_OK)  //mount
//    {
//        if (f_open(&file, "TEST.TXT", FA_WRITE | FA_CREATE_NEW ) == FR_OK) { //Open or Create TEST.TXT file
//            f_write(&file, data, sizeof(data)-1, &actualLength );    //write the first line
//            f_write(&file, data2, sizeof(data2)-1, &actualLength );  //write the second line
//            f_close(&file);
//        }
//
//        f_mount(0,"0:",0);  //unmount disk
//    }
//    showBinary(SD_status<<1);
//    msTimerDelay(2000);
//    if(!FatFsDemo_Tasks()) {
//        
//        startupShow();
//    } else {
//        showBinary(0xF0);
//    }
//    msTimerDelay(100);
    /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
    
    /* * * * * * * * * * * * * * ToF Setup * * * * * * * * * * * * * */
    selectPort(0x0, 0x0); // Select Multiplexer 0, Port 0
//    VL53L0X_init();
//    selectPort(0x0, 0x1); // Select Multiplexer 0, Port 1
//    VL53L0X_init();
//    selectPort(0x0, 0x2); // Select Multiplexer 0, Port 2
//    VL53L0X_init();
//    selectPort(0x0, 0x3); // Select Multiplexer 0, Port 3
//    VL53L0X_init();
    //selectPort(0x1, 0x0); // Select Multiplexer 1, Port 0
    //VL53L0X_init();
    //selectPort(0x1, 0x1); // Select Multiplexer 1, Port 1
    //VL53L0X_init();
    /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
    
    /* * * * * * * * * * * * Accelerometer Setup * * * * * * * * * * * */
    H3LIS200DL_begin();
    //    selectPort(0x1, 0x2);
//    writeRegister(ADXL345_I2C_ADDR, ADXL345_BW_RATE, 0x80); // 50Hz data rate
//    writeRegister(ADXL345_I2C_ADDR, ADXL345_DATA_FORMAT, 0x2B); // 0b00101011
//    // SELF-TEST diabled, INT_INVERT = 1 thus active low INTs, FULL_RES enabled
//    // right-justified, +/1 16g range
//    writeRegister(ADXL345_I2C_ADDR, ADXL345_POWER_CTL, 0x2B); // 0b00001000
//    // Measure Mode Enabled, Sleep Mode Disabled
    
    //writeRegister(H3LIS200DL_I2CADDR, H3LIS200DL_CTRL_REG1, 0b00100111);
    /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
    
    while (1) {
        /*************** I2C Time-of-Flight **************/
//        distance = VL53L0X_readRangeContinuousMillimeters();
//        showBinary(distance & 0xFF); // & 0xFF
        
        //showToF(distance);
        /*************************************************/
        
        /*************** I2C Accelerometer ***************/
        H3LIS200DL_Read_y (y);
        yp = y & 0xff;
        showBinary(yp);
//        X = 0; Y = 0; Z = 0;
//
//        while(I2C_Status != I2C1_MESSAGE_COMPLETE);
//        I2C1_MasterWrite(ADXL345_DATA_X0, 1, ADXL345_I2C_ADDR, &I2C_Status);
//        while(I2C_Status != I2C1_MESSAGE_COMPLETE);
//        I2C1_MasterRead(&accelData, 6, ADXL345_I2C_ADDR, &I2C_Status);
//        
//        showBinary(I2C_Status << 1);
//        
//        // Receive acceleration measurements as 16 bit integers
//        X = accelData[0] + (accelData[1] << 8); // (Little Endian form)
//        Y = accelData[2] + (accelData[3] << 8);
//        Z = accelData[4] + (accelData[5] << 8);
//        // Only use the 10 significant bits
//        X >>= 6; Y >>= 6; Z >>= 6;
//            
//        showBinary(Y);
        
//        X = readReg(H3LIS200DL_I2CADDR, H3LIS200DL_OUT_X); // Get Accel. X Data
//        showBinary(I2C_Status << 1);
        /*************************************************/
        
//        showCount();
        
        //FatFsDemo_Tasks();
        
        msTimerDelay(100);
    }
    return 0; 
}

// displays the byte value in binary on the LEDs
void showBinary(uint8_t n) {
    LED1 = n;
    LED2 = n >> 1;
    LED3 = n >> 2;
    LED4 = n >> 3;
    LED5 = n >> 4;
    LED6 = n >> 5;
    LED7 = n >> 6;
    LED8 = n >> 7;
}

// a fun visual to do at boot
void showStartup(void) {
    uint16_t delay = 25;
    
    uint8_t display = 0x01;
    while(display != 0x80) {     // run one LED "up"
        display = display << 1;
        showBinary(display);
        msTimerDelay(delay);
    }
    while(display > 0x00) {     // run one LED back "down"
        display = display >> 1;
        showBinary(display);
        msTimerDelay(delay);
    }
    
    display = 0x00;             // reset to 0
    while(display < 0xFF) {     // "fill" LEDs
        display = display << 1;
        showBinary(++display);
        msTimerDelay(delay);
    }
    while(display > 0x00) {     // "empty" LEDs
        display = display >> 1;
        showBinary(display);
        msTimerDelay(delay);
    }
    
}

// an incrementing binary count
void showCount(void) {
    uint8_t counter = 0x00;
    
    while(1) {
        showBinary(counter++);
        counter = counter >= 0xFF ? 0x00 : counter;
        msTimerDelay(100);
    }
}

// a visual for errors
void showError(void) {
    uint16_t delay = 50;
    
    uint8_t i = 0x00;
    while(i < 3) { // flash alternating LEDs 3 times
        showBinary(0x55);
        msTimerDelay(delay);
        showBinary(0xAA);
        msTimerDelay(delay);
        i++;
    }
}

void showToF(uint16_t dist) {
    double interval = MAX_DISTANCE/8;
    
