HunterHykes/Senior_Design_HALO/Nick/dsPIC33EP512GM706_PIM.X/main.c
    int numLEDs = (dist/interval);
    
    showBinary(0xFF >> (8 - 1 - numLEDs));
    
    /*
    switch(numLEDs) {
        case 0:
            showBinary(0x0);
            break;
        case 1:
            showBinary(0x01);
            break;
        case 2:
            showBinary(0x03);
            break;
        case 3:
            showBinary(0x07);
            break;
        case 4:
            showBinary(0x0F);
            break;
        case 5:
            showBinary(0x1F);
            break;
        case 6:
            showBinary(0x3F);
            break;
        case 7:
            showBinary(0x7F);
            break;
        case 8:
            showBinary(0xFF);
            break;
        default:
            showBinary(0x00);
            break;
    } */
}

/* * * * * * * * * * * * I2C Bus Read/Write Functions * * * * * * * * * * * */

void selectPort(uint8_t mux, uint8_t port) {
    // base mux address is 0x70
    writeRegister((MUX_0 + mux), 0x00, (0x04 + port));
}

// read the interrupts from mux
uint8_t getMuxCtrlReg(uint8_t mux) {
    // read the control register of mux
    return readReg((MUX_0 + mux), 0x00);
}

// return the port number where an interrupt is present
uint8_t getInterrupts(uint8_t mux) {
    // read the control register of mux
    uint8_t ctrlReg = getMuxCtrlReg(mux);

    uint8_t port = 0;
    while(port < 4) { // for each port on the mux
        // if the corresponding interrupt bit is 0 (interrupt present)
        // INT0 <--> ctrlReg[4]
        // INT1 <--> ctrlReg[5]
        // INT2 <--> ctrlReg[6]
        // INT3 <--> ctrlReg[7]
        if(!(ctrlReg & (0x01 << (port + 4)))) {
            return port; // return the port number if
        }
        
        port++;
    }
    
    return 0xFF;
}

// writes to the device a byte of data to the register
void writeRegister(uint8_t dev, uint8_t reg, uint8_t data) {
    uint8_t config[] = {reg, data};
    
    while(I2C_Status != I2C1_MESSAGE_COMPLETE);
    I2C1_MasterWrite(config, sizeof(config), dev, &I2C_Status);
    while(I2C_Status != I2C1_MESSAGE_COMPLETE);
    // showBinary(I2C_Status);
}

// writes to the device a byte of data to the register
void writeRegister_16b(uint8_t dev, uint8_t reg, uint16_t data) {
    // send MSB then LSB
    uint8_t config[] = {reg, data >> 8, data & 0x00FF};
    
    while(I2C_Status != I2C1_MESSAGE_COMPLETE);
    I2C1_MasterWrite(config, sizeof(config), dev, &I2C_Status);
    while(I2C_Status != I2C1_MESSAGE_COMPLETE);
}

void writeRegister_32b(uint8_t dev, uint8_t reg, uint32_t data) {
    // send MSB, ..., then LSB
    uint8_t config[] = {reg, data >> 24, data >> 16 & 0x00FF, data >> 8 & 0x00FF, data & 0x00FF};
    
    while(I2C_Status != I2C1_MESSAGE_COMPLETE);
    I2C1_MasterWrite(config, sizeof(config), dev, &I2C_Status);
    while(I2C_Status != I2C1_MESSAGE_COMPLETE);
}

// reads from the device a byte of data from the given register
void readRegister(uint8_t dev, uint8_t reg, uint8_t* data) {
    while(I2C_Status != I2C1_MESSAGE_COMPLETE);
    I2C1_MasterWrite(&reg, 1, dev, &I2C_Status);
    while(I2C_Status != I2C1_MESSAGE_COMPLETE);
    I2C1_MasterRead(data, 1, dev, &I2C_Status);
    while(I2C_Status != I2C1_MESSAGE_COMPLETE);
}

uint16_t readRegister_16b(uint8_t dev, uint8_t reg) {
    uint8_t data[2];
    
    while(I2C_Status != I2C1_MESSAGE_COMPLETE);
    I2C1_MasterWrite(&reg, 1, dev, &I2C_Status);
    while(I2C_Status != I2C1_MESSAGE_COMPLETE);
    I2C1_MasterRead(data, 2, dev, &I2C_Status);
    while(I2C_Status != I2C1_MESSAGE_COMPLETE);
    
    return ((data[0] << 8) + data[1]); // MSB first (VL53L0X pg. 15)
    //return (data[0] >> 8 + data[1]); // LSB first
    // TODO: switch endianness if need be
}

uint8_t data;
uint8_t readReg(uint8_t dev, uint8_t reg) {
    
    while(I2C_Status != I2C1_MESSAGE_COMPLETE);
    I2C1_MasterWrite(&reg, 1, dev, &I2C_Status);
    while(I2C_Status != I2C1_MESSAGE_COMPLETE);
    I2C1_MasterRead(&data, 1, dev, &I2C_Status);
    while(I2C_Status != I2C1_MESSAGE_COMPLETE);
    
    return data;
}
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * ToF Sensor Functions * * * * * * * * * * * * * */
bool VL53L0X_init(void) {
    bool success = VL53L0X_config(); // configure ToF
    VL53L0X_setTimeout(500);
    // Start continuous back-to-back mode (take readings as
    // fast as possible).  To use continuous timed mode
    // instead, provide a desired inter-measurement period in
    // ms (e.g. sensor.startContinuous(100))
    VL53L0X_setMeasurementTimingBudget(200000);
    VL53L0X_startContinuous(0);
    
    return success;
}

bool VL53L0X_config(void) {
    // VL53L0X_DataInit() begin

    // "Set I2C standard mode"
    writeRegister(VL53L0X_I2CADDR, 0x88, 0x00);

    writeRegister(VL53L0X_I2CADDR, 0x80, 0x01);
    writeRegister(VL53L0X_I2CADDR, 0xFF, 0x01);
    writeRegister(VL53L0X_I2CADDR, 0x00, 0x00);

    stop_variable = readReg(VL53L0X_I2CADDR, 0x91);

    writeRegister(VL53L0X_I2CADDR, 0x00, 0x01);
    writeRegister(VL53L0X_I2CADDR, 0xFF, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x80, 0x00);

    // disable SIGNAL_RATE_MSRC (bit 1) and SIGNAL_RATE_PRE_RANGE (bit 4) limit checks
    writeRegister(VL53L0X_I2CADDR, MSRC_CONFIG_CONTROL, readReg(VL53L0X_I2CADDR, MSRC_CONFIG_CONTROL) | 0x12);

    // set final range signal rate limit to 0.25 MCPS (million counts per second)
    VL53L0X_setSignalRateLimit(0.25);

    writeRegister(VL53L0X_I2CADDR, SYSTEM_SEQUENCE_CONFIG, 0xFF);

    // VL53L0X_DataInit() end

    // VL53L0X_StaticInit() begin

    uint8_t spad_count;
    bool spad_type_is_aperture;
    if (!VL53L0X_getSpadInfo(&spad_count, &spad_type_is_aperture)) { return false; }

    // The SPAD map (RefGoodSpadMap) is read by VL53L0X_get_info_from_device() in
    // the API, but the same data seems to be more easily readable from
    // GLOBAL_CONFIG_SPAD_ENABLES_REF_0 through _6, so read it from there
    uint8_t ref_spad_map[6];

    VL53L0X_Read(GLOBAL_CONFIG_SPAD_ENABLES_REF_0, ref_spad_map, 6);

    // -- VL53L0X_set_reference_spads() begin (assume NVM values are valid)

    writeRegister(VL53L0X_I2CADDR, 0xFF, 0x01);
    writeRegister(VL53L0X_I2CADDR, DYNAMIC_SPAD_REF_EN_START_OFFSET, 0x00);
    writeRegister(VL53L0X_I2CADDR, DYNAMIC_SPAD_NUM_REQUESTED_REF_SPAD, 0x2C);
    writeRegister(VL53L0X_I2CADDR, 0xFF, 0x00);
    writeRegister(VL53L0X_I2CADDR, GLOBAL_CONFIG_REF_EN_START_SELECT, 0xB4);

    uint8_t first_spad_to_enable = spad_type_is_aperture ? 12 : 0; // 12 is the first aperture spad
    uint8_t spads_enabled = 0;

    uint8_t i;
    for (i = 0; i < 48; i++) {
      if (i < first_spad_to_enable || spads_enabled == spad_count) {
        // This bit is lower than the first one that should be enabled, or
        // (reference_spad_count) bits have already been enabled, so zero this bit
        ref_spad_map[i / 8] &= ~(1 << (i % 8));
      }
      else if ((ref_spad_map[i / 8] >> (i % 8)) & 0x1) {
        spads_enabled++;
      }
    }

    // TODO: ?
    //writeMulti(GLOBAL_CONFIG_SPAD_ENABLES_REF_0, ref_spad_map, 6);
//    while(I2C_Status != I2C1_MESSAGE_COMPLETE);
//    I2C1_MasterWrite(GLOBAL_CONFIG_SPAD_ENABLES_REF_0, 1, VL53L0X_I2CADDR, &I2C_Status);
    while(I2C_Status != I2C1_MESSAGE_COMPLETE);
    I2C1_MasterWrite(ref_spad_map, sizeof(ref_spad_map), VL53L0X_I2CADDR, &I2C_Status);
    while(I2C_Status != I2C1_MESSAGE_COMPLETE);
    
    // -- VL53L0X_set_reference_spads() end

    // -- VL53L0X_load_tuning_settings() begin
    // DefaultTuningSettings from vl53l0x_tuning.h

    writeRegister(VL53L0X_I2CADDR, 0xFF, 0x01);
    writeRegister(VL53L0X_I2CADDR, 0x00, 0x00);

    writeRegister(VL53L0X_I2CADDR, 0xFF, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x09, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x10, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x11, 0x00);

    writeRegister(VL53L0X_I2CADDR, 0x24, 0x01);
    writeRegister(VL53L0X_I2CADDR, 0x25, 0xFF);
    writeRegister(VL53L0X_I2CADDR, 0x75, 0x00);

    writeRegister(VL53L0X_I2CADDR, 0xFF, 0x01);
    writeRegister(VL53L0X_I2CADDR, 0x4E, 0x2C);
    writeRegister(VL53L0X_I2CADDR, 0x48, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x30, 0x20);

    writeRegister(VL53L0X_I2CADDR, 0xFF, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x30, 0x09);
    writeRegister(VL53L0X_I2CADDR, 0x54, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x31, 0x04);
    writeRegister(VL53L0X_I2CADDR, 0x32, 0x03);
    writeRegister(VL53L0X_I2CADDR, 0x40, 0x83);
    writeRegister(VL53L0X_I2CADDR, 0x46, 0x25);
    writeRegister(VL53L0X_I2CADDR, 0x60, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x27, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x50, 0x06);
    writeRegister(VL53L0X_I2CADDR, 0x51, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x52, 0x96);
    writeRegister(VL53L0X_I2CADDR, 0x56, 0x08);
    writeRegister(VL53L0X_I2CADDR, 0x57, 0x30);
    writeRegister(VL53L0X_I2CADDR, 0x61, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x62, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x64, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x65, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x66, 0xA0);

    writeRegister(VL53L0X_I2CADDR, 0xFF, 0x01);
    writeRegister(VL53L0X_I2CADDR, 0x22, 0x32);
    writeRegister(VL53L0X_I2CADDR, 0x47, 0x14);
    writeRegister(VL53L0X_I2CADDR, 0x49, 0xFF);
    writeRegister(VL53L0X_I2CADDR, 0x4A, 0x00);

    writeRegister(VL53L0X_I2CADDR, 0xFF, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x7A, 0x0A);
    writeRegister(VL53L0X_I2CADDR, 0x7B, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x78, 0x21);

    writeRegister(VL53L0X_I2CADDR, 0xFF, 0x01);
    writeRegister(VL53L0X_I2CADDR, 0x23, 0x34);
    writeRegister(VL53L0X_I2CADDR, 0x42, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x44, 0xFF);
    writeRegister(VL53L0X_I2CADDR, 0x45, 0x26);
    writeRegister(VL53L0X_I2CADDR, 0x46, 0x05);
    writeRegister(VL53L0X_I2CADDR, 0x40, 0x40);
    writeRegister(VL53L0X_I2CADDR, 0x0E, 0x06);
    writeRegister(VL53L0X_I2CADDR, 0x20, 0x1A);
    writeRegister(VL53L0X_I2CADDR, 0x43, 0x40);

    writeRegister(VL53L0X_I2CADDR, 0xFF, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x34, 0x03);
    writeRegister(VL53L0X_I2CADDR, 0x35, 0x44);

    writeRegister(VL53L0X_I2CADDR, 0xFF, 0x01);
    writeRegister(VL53L0X_I2CADDR, 0x31, 0x04);
    writeRegister(VL53L0X_I2CADDR, 0x4B, 0x09);
    writeRegister(VL53L0X_I2CADDR, 0x4C, 0x05);
    writeRegister(VL53L0X_I2CADDR, 0x4D, 0x04);

    writeRegister(VL53L0X_I2CADDR, 0xFF, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x44, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x45, 0x20);
    writeRegister(VL53L0X_I2CADDR, 0x47, 0x08);
    writeRegister(VL53L0X_I2CADDR, 0x48, 0x28);
    writeRegister(VL53L0X_I2CADDR, 0x67, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x70, 0x04);
    writeRegister(VL53L0X_I2CADDR, 0x71, 0x01);
    writeRegister(VL53L0X_I2CADDR, 0x72, 0xFE);
    writeRegister(VL53L0X_I2CADDR, 0x76, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x77, 0x00);

    writeRegister(VL53L0X_I2CADDR, 0xFF, 0x01);
    writeRegister(VL53L0X_I2CADDR, 0x0D, 0x01);

    writeRegister(VL53L0X_I2CADDR, 0xFF, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x80, 0x01);
    writeRegister(VL53L0X_I2CADDR, 0x01, 0xF8);

    writeRegister(VL53L0X_I2CADDR, 0xFF, 0x01);
    writeRegister(VL53L0X_I2CADDR, 0x8E, 0x01);
    writeRegister(VL53L0X_I2CADDR, 0x00, 0x01);
    writeRegister(VL53L0X_I2CADDR, 0xFF, 0x00);
    writeRegister(VL53L0X_I2CADDR, 0x80, 0x00);

