HunterHykes/Senior_Design_HALO/Nick/dsPIC33EP512GM706_PIM.X/main.c
    // -- VL53L0X_load_tuning_settings() end

    // "Set interrupt config to new sample ready"
    // -- VL53L0X_SetGpioConfig() begin

    writeRegister(VL53L0X_I2CADDR, SYSTEM_INTERRUPT_CONFIG_GPIO, 0x04);
    writeRegister(VL53L0X_I2CADDR, GPIO_HV_MUX_ACTIVE_HIGH, readReg(VL53L0X_I2CADDR, GPIO_HV_MUX_ACTIVE_HIGH) & ~0x10); // active low
    writeRegister(VL53L0X_I2CADDR, SYSTEM_INTERRUPT_CLEAR, 0x01);

    // -- VL53L0X_SetGpioConfig() end

    measurement_timing_budget_us = VL53L0X_getMeasurementTimingBudget();

    // "Disable MSRC and TCC by default"
    // MSRC = Minimum Signal Rate Check
    // TCC = Target CentreCheck
    // -- VL53L0X_SetSequenceStepEnable() begin

    writeRegister(VL53L0X_I2CADDR, SYSTEM_SEQUENCE_CONFIG, 0xE8);

    // -- VL53L0X_SetSequenceStepEnable() end

    // "Recalculate timing budget"
    VL53L0X_setMeasurementTimingBudget(measurement_timing_budget_us);

    // VL53L0X_StaticInit() end

    // VL53L0X_PerformRefCalibration() begin (VL53L0X_perform_ref_calibration())

    // -- VL53L0X_perform_vhv_calibration() begin

    writeRegister(VL53L0X_I2CADDR, SYSTEM_SEQUENCE_CONFIG, 0x01);
    if (!VL53L0X_performSingleRefCalibration(0x40)) { return false; }

    // -- VL53L0X_perform_vhv_calibration() end

    // -- VL53L0X_perform_phase_calibration() begin

    writeRegister(VL53L0X_I2CADDR, SYSTEM_SEQUENCE_CONFIG, 0x02);
    if (!VL53L0X_performSingleRefCalibration(0x00)) { return false; }

    // -- VL53L0X_perform_phase_calibration() end

    // "restore the previous Sequence Config"
    writeRegister(VL53L0X_I2CADDR, SYSTEM_SEQUENCE_CONFIG, 0xE8);

    // VL53L0X_PerformRefCalibration() end

    return true;
}

bool VL53L0X_setSignalRateLimit(float limit_Mcps) {
    if (limit_Mcps < 0 || limit_Mcps > 511.99) { return false; }

    // Q9.7 fixed point format (9 integer bits, 7 fractional bits)
    writeRegister_16b(VL53L0X_I2CADDR, FINAL_RANGE_CONFIG_MIN_COUNT_RATE_RTN_LIMIT, limit_Mcps * (1 << 7));
    return true;
}

// Get reference SPAD (single photon avalanche diode) count and type
// based on VL53L0X_get_info_from_device(),
// but only gets reference SPAD count and type
bool VL53L0X_getSpadInfo(uint8_t * count, bool * type_is_aperture) {
  uint8_t tmp;

  writeRegister(VL53L0X_I2CADDR, 0x80, 0x01);
  writeRegister(VL53L0X_I2CADDR, 0xFF, 0x01);
  writeRegister(VL53L0X_I2CADDR, 0x00, 0x00);

  writeRegister(VL53L0X_I2CADDR, 0xFF, 0x06);
  writeRegister(VL53L0X_I2CADDR, 0x83, readReg(VL53L0X_I2CADDR, 0x83) | 0x04);
  writeRegister(VL53L0X_I2CADDR, 0xFF, 0x07);
  writeRegister(VL53L0X_I2CADDR, 0x81, 0x01);

  writeRegister(VL53L0X_I2CADDR, 0x80, 0x01);

  writeRegister(VL53L0X_I2CADDR, 0x94, 0x6b);
  writeRegister(VL53L0X_I2CADDR, 0x83, 0x00);
  startTimeout();
  // HELP
  while (readReg(VL53L0X_I2CADDR, 0x83) == 0x00) {
    if (checkTimeoutExpired()) { return false; }
  }
  writeRegister(VL53L0X_I2CADDR, 0x83, 0x01);
  readRegister(VL53L0X_I2CADDR, 0x92, &tmp);

  *count = tmp & 0x7f;
  *type_is_aperture = (tmp >> 7) & 0x01;

  writeRegister(VL53L0X_I2CADDR, 0x81, 0x00);
  writeRegister(VL53L0X_I2CADDR, 0xFF, 0x06);
  writeRegister(VL53L0X_I2CADDR, 0x83, readReg(VL53L0X_I2CADDR, 0x83) & ~0x04);  //(3) for this
  writeRegister(VL53L0X_I2CADDR, 0xFF, 0x01);
  writeRegister(VL53L0X_I2CADDR, 0x00, 0x01);

  writeRegister(VL53L0X_I2CADDR, 0xFF, 0x00);
  writeRegister(VL53L0X_I2CADDR, 0x80, 0x00);

  return true;
}

// Get the measurement timing budget in microseconds
// based on VL53L0X_get_measurement_timing_budget_micro_seconds()
// in us
uint32_t VL53L0X_getMeasurementTimingBudget(void) {
    SequenceStepEnables enables;
    SequenceStepTimeouts timeouts;

    uint16_t const StartOverhead     = 1910; // note that this is different than the value in set_
    uint16_t const EndOverhead        = 960;
    uint16_t const MsrcOverhead       = 660;
    uint16_t const TccOverhead        = 590;
    uint16_t const DssOverhead        = 690;
    uint16_t const PreRangeOverhead   = 660;
    uint16_t const FinalRangeOverhead = 550;

    // "Start and end overhead times always present"
    uint32_t budget_us = StartOverhead + EndOverhead;

    VL53L0X_getSequenceStepEnables(&enables);
    VL53L0X_getSequenceStepTimeouts(&enables, &timeouts);

    if (enables.tcc) {
      budget_us += (timeouts.msrc_dss_tcc_us + TccOverhead);
    }

    if (enables.dss) {
      budget_us += 2 * (timeouts.msrc_dss_tcc_us + DssOverhead);
    }
    else if (enables.msrc) {
      budget_us += (timeouts.msrc_dss_tcc_us + MsrcOverhead);
    }

    if (enables.pre_range) {
      budget_us += (timeouts.pre_range_us + PreRangeOverhead);
    }

    if (enables.final_range) {
        budget_us += (timeouts.final_range_us + FinalRangeOverhead);
    }

    measurement_timing_budget_us = budget_us; // store for internal reuse
    return budget_us;
}

// Get sequence step enables
// based on VL53L0X_GetSequenceStepEnables()
void VL53L0X_getSequenceStepEnables(SequenceStepEnables * enables) {
  uint8_t sequence_config;
  readRegister(VL53L0X_I2CADDR, SYSTEM_SEQUENCE_CONFIG, &sequence_config);

  enables->tcc          = (sequence_config >> 4) & 0x1;
  enables->dss          = (sequence_config >> 3) & 0x1;
  enables->msrc         = (sequence_config >> 2) & 0x1;
  enables->pre_range    = (sequence_config >> 6) & 0x1;
  enables->final_range  = (sequence_config >> 7) & 0x1;
}

// Get sequence step timeouts
// based on get_sequence_step_timeout(),
// but gets all timeouts instead of just the requested one, and also stores
// intermediate values
void VL53L0X_getSequenceStepTimeouts(SequenceStepEnables const * enables, SequenceStepTimeouts * timeouts) {
  timeouts->pre_range_vcsel_period_pclks = VL53L0X_getVcselPulsePeriod(VcselPeriodPreRange);

  timeouts->msrc_dss_tcc_mclks = readReg(VL53L0X_I2CADDR, MSRC_CONFIG_TIMEOUT_MACROP) + 1;
  timeouts->msrc_dss_tcc_us =
    VL53L0X_timeoutMclksToMicroseconds(timeouts->msrc_dss_tcc_mclks,
                               timeouts->pre_range_vcsel_period_pclks);

  timeouts->pre_range_mclks =
    VL53L0X_decodeTimeout(readRegister_16b(VL53L0X_I2CADDR, PRE_RANGE_CONFIG_TIMEOUT_MACROP_HI));
  timeouts->pre_range_us =
    VL53L0X_timeoutMclksToMicroseconds(timeouts->pre_range_mclks,
                               timeouts->pre_range_vcsel_period_pclks);

  timeouts->final_range_vcsel_period_pclks = VL53L0X_getVcselPulsePeriod(VcselPeriodFinalRange);

  timeouts->final_range_mclks =
    VL53L0X_decodeTimeout(readRegister_16b(VL53L0X_I2CADDR, FINAL_RANGE_CONFIG_TIMEOUT_MACROP_HI));

  if (enables->pre_range) {
    timeouts->final_range_mclks -= timeouts->pre_range_mclks;
  }

  timeouts->final_range_us =
    VL53L0X_timeoutMclksToMicroseconds(timeouts->final_range_mclks,
                               timeouts->final_range_vcsel_period_pclks);
}

