HunterHykes/Senior_Design_HALO/Nick/dsPIC33EP512GM706_PIM.X/main.c
    uint16_t osc_calibrate_val = readRegister_16b(VL53L0X_I2CADDR, OSC_CALIBRATE_VAL);

    if (osc_calibrate_val != 0) {
      period_ms *= osc_calibrate_val;
    }

    writeRegister_32b(VL53L0X_I2CADDR, SYSTEM_INTERMEASUREMENT_PERIOD, period_ms);

    // VL53L0X_SetInterMeasurementPeriodMilliSeconds() end

    writeRegister(VL53L0X_I2CADDR, SYSRANGE_START, 0x04); // VL53L0X_REG_SYSRANGE_MODE_TIMED
  }
  else {
    // continuous back-to-back mode
    writeRegister(VL53L0X_I2CADDR, SYSRANGE_START, 0x02); // VL53L0X_REG_SYSRANGE_MODE_BACKTOBACK
  }
}

// Stop continuous measurements
// based on VL53L0X_StopMeasurement()

void VL53L0X_stopContinuous(void) {
  writeRegister(VL53L0X_I2CADDR, SYSRANGE_START, 0x01); // VL53L0X_REG_SYSRANGE_MODE_SINGLESHOT

  writeRegister(VL53L0X_I2CADDR, 0xFF, 0x01);
  writeRegister(VL53L0X_I2CADDR, 0x00, 0x00);
  writeRegister(VL53L0X_I2CADDR, 0x91, 0x00);
  writeRegister(VL53L0X_I2CADDR, 0x00, 0x01);
  writeRegister(VL53L0X_I2CADDR, 0xFF, 0x00);
}

// Returns a range reading in millimeters when continuous mode is active
// (readRangeSingleMillimeters() also calls this function after starting a
// single-shot range measurement)
uint16_t VL53L0X_readRangeContinuousMillimeters(void) {
  startTimeout();
  while ((readReg(VL53L0X_I2CADDR, RESULT_INTERRUPT_STATUS) & 0x07) == 0)
  {
    if (checkTimeoutExpired())
    {
      did_timeout = true;
      return 65535;
    }
  }

  // assumptions: Linearity Corrective Gain is 1000 (default);
  // fractional ranging is not enabled
  uint16_t range = readRegister_16b(VL53L0X_I2CADDR, RESULT_RANGE_STATUS + 10);

  writeRegister(VL53L0X_I2CADDR, SYSTEM_INTERRUPT_CLEAR, 0x01);

  return range;
}

// Performs a single-shot range measurement and returns the reading in
// millimeters
// based on VL53L0X_PerformSingleRangingMeasurement()
uint16_t VL53L0X_readRangeSingleMillimeters(void) {
  writeRegister(VL53L0X_I2CADDR, 0x80, 0x01);
  writeRegister(VL53L0X_I2CADDR, 0xFF, 0x01);
  writeRegister(VL53L0X_I2CADDR, 0x00, 0x00);
  writeRegister(VL53L0X_I2CADDR, 0x91, stop_variable);
  writeRegister(VL53L0X_I2CADDR, 0x00, 0x01);
  writeRegister(VL53L0X_I2CADDR, 0xFF, 0x00);
  writeRegister(VL53L0X_I2CADDR, 0x80, 0x00);

  writeRegister(VL53L0X_I2CADDR, SYSRANGE_START, 0x01);

  // "Wait until start bit has been cleared"
  startTimeout();
  while (readReg(VL53L0X_I2CADDR, SYSRANGE_START) & 0x01)
  {
    if (checkTimeoutExpired())
    {
      did_timeout = true;
      return 65535;
    }
  }

  return VL53L0X_readRangeContinuousMillimeters();
}

// Did a timeout occur in one of the read functions since the last call to
// timeoutOccurred()?
bool VL53L0X_timeoutOccurred() {
    bool tmp = did_timeout;
    did_timeout = false;
    return tmp;
}
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

//start Functions for Accelerometer

void H3LIS200DL_begin()
{
    H3LIS200DL_setPowerMode(0x01);
    H3LIS200DL_axesEnable(true);

    uint8_t data = 0;
  
    int i = 0x21;
    for (i = 0x21; i < 0x24; i++) {
        writeRegister(H3LIS200DL_I2CADDR, i, data);
    }
  
    int j = 0x30;
    for (j = 0x30; j < 0x37; j++) {
      writeRegister(H3LIS200DL_I2CADDR, j, data);    
    }
}

void H3LIS200DL_axesEnable(bool enable)
{
  uint8_t data;
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_CTRL_REG1, &data);
  if (enable)
  {
    data |= 0x07;
  }
  else
  {
    data &= ~0x07;
  }
  writeRegister(H3LIS200DL_I2CADDR, H3LIS200DL_CTRL_REG1, data);
}

void H3LIS200DL_setPowerMode(power_mode pmode)
{
  uint8_t data;
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_CTRL_REG1, &data);
  
  // The power mode is the high three bits of CTRL_REG1. The mode 
  //  constants are the appropriate bit values left shifted by five, so we 
  //  need to right shift them to make them work. We also want to mask off the
  //  top three bits to zero, and leave the others untouched, so we *only*
  //  affect the power mode bits.
  data &= ~0xe0;    // Clear the top three bits
  data |= pmode<<5; // set the top three bits to our pmode value
  writeRegister(H3LIS200DL_I2CADDR, H3LIS200DL_CTRL_REG1, data); // write the new value to CTRL_REG1
}

void H3LIS200DL_setODR(data_rate drate)
{
  uint8_t data;
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_CTRL_REG1,  &data);

  // The data rate is bits 4:3 of CTRL_REG1. The data rate constants are the
  //  appropriate bit values; we need to right shift them by 3 to align them
  //  with the appropriate bits in the register. We also want to mask off the
  //  top three and bottom three bits, as those are unrelated to data rate and
  //  we want to only change the data rate.
  data &=~0x18;     // Clear the two data rate bits
  data |= drate<<3; // Set the two data rate bits appropriately.
  writeRegister(H3LIS200DL_I2CADDR, H3LIS200DL_CTRL_REG1, data); // write the new value to CTRL_REG1
}

void H3LIS200DL_readAxes(int16_t* x, int16_t* y, int16_t* z)
{
  uint8_t data[6]; // create a buffer for our incoming data
  
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_OUT_X_L, &data[0]);
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_OUT_X_H, &data[1]);
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_OUT_Y_L, &data[2]);
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_OUT_Y_H, &data[3]);
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_OUT_Z_L, &data[4]);
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_OUT_Z_H, &data[5]);
  // The data that comes out is 12-bit data, left justified, so the lower
  //  four bits of the data are always zero. We need to right shift by four,
  //  then typecase the upper data to an integer type so it does a signed
  //  right shift.
  x = data[0] | data[1] << 8;
  y = data[2] | data[3] << 8;
  z = data[4] | data[5] << 8;
  x = *x >> 4;
  y = *y >> 4;
  z = *z >> 4;
}

int16_t H3LIS200DL_Read_x(int16_t x)
{
  uint8_t data[6];
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_OUT_X_L, &data[0]);
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_OUT_X_H, &data[1]);
  x = data[0] | data[1] << 8;
  x = x >> 4;
  return(x);
}
int16_t H3LIS200DL_Read_y(int16_t y)
{
  uint8_t data[6];
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_OUT_Y_L, &data[2]);
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_OUT_Y_H, &data[3]);
  y = data[2] | data[3] << 8;
  y = y >> 4;
  return(y);
}
int16_t H3LIS200DL_Read_z(int16_t z)
{
  uint8_t data[6];
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_OUT_Z_L, &data[4]);
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_OUT_Z_H, &data[5]);
  z = data[4] | data[5] << 8;
  z = z >> 4;
  return(z);
}

//uint8_t H3LIS200DL_readReg(uint8_t reg_address)
//{
//  uint8_t data;
//  H3LIS200DL_Read(reg_address, &data, 1);
//  return data;
//}

float H3LIS200DL_convertToG(int maxScale, int reading)
{
    maxScale = (float)maxScale;
    reading = (float)reading;
  float result = ((maxScale * reading)/2047);
  return result;
}

void H3LIS200DL_setHighPassCoeff(high_pass_cutoff_freq_cfg hpcoeff)
{
  // The HPF coeff depends on the output data rate. The cutoff frequency is
  //  is approximately fs/(6*HPc) where HPc is 8, 16, 32 or 64, corresponding
  //  to the various constants available for this parameter.
  uint8_t data;
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_CTRL_REG2,  &data);
  data &= ~0xfc;  // Clear the two low bits of the CTRL_REG2
  data |= hpcoeff;
  writeRegister(H3LIS200DL_CTRL_REG2, data, 1);
}

void H3LIS200DL_enableHPF(bool enable)
{
  // Enable the high pass filter
  uint8_t data;
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_CTRL_REG2,  &data);
  if (enable)
  {
    data |= 1<<5;
  }
  else
  {
    data &= ~(1<<5);
  }
  writeRegister(H3LIS200DL_CTRL_REG2, data, 1);
}

void H3LIS200DL_HPFOnIntPin(bool enable, uint8_t pin)
{
  // Enable the hpf on signal to int pins 
  uint8_t data;
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_CTRL_REG2,  &data);
  if (enable)
  {
    if (pin == 1)
    {
      data |= 1<<3;
    }
    if (pin == 2)
    {
      data |= 1<<4;
    }
  }
  else
  {
    if (pin == 1)
    {
      data &= ~1<<3;
    }
    if (pin == 2)
    {
      data &= ~1<<4;
    }
  }
  writeRegister(H3LIS200DL_CTRL_REG2, data, 1);
}

void H3LIS200DL_intActiveHigh(bool enable)
{
  // Are the int pins active high or active low?
  uint8_t data;
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_CTRL_REG3,  &data);
  // Setting bit 7 makes int pins active low
  if (!enable)
  {
    data |= 1<<7;
  }
  else
  {
    data &= ~(1<<7);
  }
  writeRegister(H3LIS200DL_CTRL_REG3, data, 1);
}

