HunterHykes/Senior_Design_HALO/Nick/dsPIC33EP512GM706_PIM.X/main.c
void H3LIS200DL_intPinMode(pp_od _pinMode)
{
  uint8_t data;
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_CTRL_REG3,  &data);
  // Setting bit 6 makes int pins open drain.
  if (_pinMode == OPEN_DRAIN)
  {
    data |= 1<<6;
  }
  else
  {
    data &= ~(1<<6);
  }
  writeRegister(H3LIS200DL_CTRL_REG3, data, 1);
}

void H3LIS200DL_latchInterrupt(bool enable, uint8_t intSource)
{
  // Latch mode for interrupt. When enabled, you must read the INTx_SRC reg
  //  to clear the interrupt and make way for another.
  uint8_t data; 
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_CTRL_REG3,  &data);
  // Enable latching by setting the appropriate bit.
  if (enable)
  {
    if (intSource == 1)
    {
      data |= 1<<2;
    }
    if (intSource == 2)
    {
      data |= 1<<5;
    }
  }
  else
  {
    if (intSource == 1)
    {
      data &= ~1<<2;
    }
    if (intSource == 2)
    {
      data &= ~1<<5;
    }
  }
  writeRegister(H3LIS200DL_CTRL_REG3, data, 1);
}

void H3LIS200DL_intSrcConfig(int_sig_src src, uint8_t pin)
{

  uint8_t data; 
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_CTRL_REG3,  &data);
  // Enable latching by setting the appropriate bit.
  if (pin == 1)
  {
    data &= ~0xfc; // clear the low two bits of the register
    data |= src;
  }
  if (pin == 2)
  {
    data &= ~0xe7; // clear bits 4:3 of the register
    data |= src<<4;
  }
  writeRegister(H3LIS200DL_CTRL_REG3, data, 1);
}

void H3LIS200DL_setFullScale(fs_range range)
{
  uint8_t data; 
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_CTRL_REG4,  &data);
  data &= ~0xcf;
  data |= range<<4;
  writeRegister(H3LIS200DL_CTRL_REG4, data, 1);
}

bool H3LIS200DL_newXData()
{
  uint8_t data;
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_STATUS_REG,  &data);
  if (data & 1<<0)
  {
    return true;
  }
  else
  {
    return false;
  }
}

bool H3LIS200DL_newYData()
{
  uint8_t data;
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_STATUS_REG,  &data);
  if (data & 1<<1)
  {
    return true;
  }
  else
  {
    return false;
  }
}

bool H3LIS200DL_newZData()
{
  uint8_t data;
  readRegister(H3LIS200DL_I2CADDR, H3LIS200DL_STATUS_REG,  &data);
  if (data & 1<<2)
  {
    return true;
  }
  else
  {
    return false;
  }
}

void H3LIS200DL_enableInterrupt(int_axis axis, trig_on_level trigLevel,
                     uint8_t interrupt, bool enable)
{
  uint8_t data, reg, mask; 
  mask = 0;
  if (interrupt == 1)
  {
    reg = H3LIS200DL_INT1_CFG;
  }
  else
  {
    reg = H3LIS200DL_INT2_CFG;
  }
  readRegister(H3LIS200DL_I2CADDR, reg,  &data);
  if (trigLevel == TRIG_ON_HIGH)
  {
    mask = 1<<1;
  }
  else
  {
    mask = 1;
  }
  if (axis == Z_AXIS) mask = mask<<4;
  if (axis == Y_AXIS) mask = mask<<2;
  if (enable)
  {
    data |= mask;
  }
  else
  {
    data &= ~mask;
  }
  writeRegister(reg, data, 1);
}

void H3LIS200DL_setIntDuration(uint8_t duration, uint8_t intSource)
{
  if (intSource == 1)
  {
    writeRegister(H3LIS200DL_INT1_DURATION, duration, 1);
  }
  else
  {
    writeRegister(H3LIS200DL_INT2_DURATION, duration, 1);
  }
}

void H3LIS200DL_setIntThreshold(uint8_t threshold, uint8_t intSource)
{
  if (intSource == 1)
  {
    writeRegister(H3LIS200DL_INT1_THS, threshold, 1);
  }
  else
  {
    writeRegister(H3LIS200DL_INT2_THS, threshold, 1);
  }
}

/**
 End of File
*/